# MarkerByClass

## Description
Sets the default document marker style to the marker style of the active class.

```pascal
PROCEDURE MarkerByClass;
```

```python
def vs.MarkerByClass():
    return None
```

## Remarks
Sets the global attributes to use the arrow style of the default class.
[sd 8/19/98]

## Examples
```pascal
MarkerByClass;
```
```python
vs.FillColorByClass()
vs.PenColorByClass()
vs.MarkerByClass()
vs.FPatByClass()
vs.LSByClass()
vs.LWByClass()
```

## Version
Availability: from VectorWorks8.0

## Category
* Classes